Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::v1::Transition Class Referencefinal
MEP Element Manager
The Transition is an element that connects two different Routing Segments. More...
#include <MEPTransition.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Transition:
 Public Member Functions
~Transition ()
std::optional< double >  | GetInsulationThickness () const
double  | GetAngle () const
double  | GetLength () const
double  | GetOffsetY () const
double  | GetOffsetZ () const
UniqueID  | GetNarrowerPortID () const
UniqueID  | GetWiderPortID () const
UniqueID  | GetRoutingNodeId () const
Domain  | GetDomain () const
TransitionDefault  | PickUpDefault () const
Picks up and returns the Default of the Transition.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executed the passed modifier scope in an Undoable command.
~Modifier ()
Result< void >  | SetAngle (double angle)
Sets the angle of the Transition.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Static Public Member Functions
static Result< Transition >  | Get (const UniqueID &uniqueId)
Returns a Transition.
 Public Attributes
friend  | Transition
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ElementBase ()
Detailed Description
The Transition is an element that connects two different Routing Segments.
Routing Segments can differ from each other in size or shape.
Since
Archicad 27
Example code snippet from Test/New MEP
Getters
 ACAPI::Result<Transition> transition = Transition::Get (id);
 if (transition.IsErr ()) {
 ACAPI_WriteReport (transition.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter transitionReporter (3);
 transitionReporter.Add ("Transition id", id);
 transitionReporter.SetTabCount (4);
 transitionReporter.Add ("Angle", transition->GetAngle ());
 transitionReporter.Add ("Length", transition->GetLength ());
 transitionReporter.Add ("Offset Y", transition->GetOffsetY ());
 transitionReporter.Add ("Offset Z", transition->GetOffsetZ ());
 transitionReporter.Add ("Id of the narrower Port", transition->GetNarrowerPortID ());
 transitionReporter.Add ("Id of the wider Port", transition->GetWiderPortID ());
 transitionReporter.Write ();
Constructor & Destructor Documentation
◆ ~Transition()
 ACAPI::MEP::v1::Transition::~Transition  |  ( |   | )
◆ ~Modifier()
 ACAPI::MEP::v1::Transition::~Modifier  |  ( |   | )
Member Function Documentation
◆ Get()
 static Result< Transition > ACAPI::MEP::v1::Transition::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns a Transition.
Parameters
uniqueId | The UniqueID of the requested Transition.
Returns
If the uniqueId belongs to a Transition, returns the object associated to it, otherwise Error.
◆ GetAngle()
 double ACAPI::MEP::v1::Transition::GetAngle  |  ( |   | ) |   const
Returns
Returns the angle of the Transition in degrees.
◆ GetDomain()
 Domain ACAPI::MEP::v1::Transition::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the element.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::v1::Transition::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the Transition has insulation, otherwise std::nullopt. Transition of cable carrier domain cannot have insulation.
◆ GetLength()
 double ACAPI::MEP::v1::Transition::GetLength  |  ( |   | ) |   const
Returns
Returns the length of the Transition.
◆ GetNarrowerPortID()
 UniqueID ACAPI::MEP::v1::Transition::GetNarrowerPortID  |  ( |   | ) |   const
Returns
Returns the ID of the narrower port.
◆ GetOffsetY()
 double ACAPI::MEP::v1::Transition::GetOffsetY  |  ( |   | ) |   const
Returns
Returns the offset of the Transition in the Y direction.
◆ GetOffsetZ()
 double ACAPI::MEP::v1::Transition::GetOffsetZ  |  ( |   | ) |   const
Returns
Returns the offset of the Transition in the Z direction.
◆ GetRoutingNodeId()
 UniqueID ACAPI::MEP::v1::Transition::GetRoutingNodeId  |  ( |   | ) |   const
Returns
Returns the UniqueID of the RoutingNode that it belongs to.
◆ GetWiderPortID()
 UniqueID ACAPI::MEP::v1::Transition::GetWiderPortID  |  ( |   | ) |   const
Returns
Returns the ID of the wider port.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::Transition::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executed the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appear in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 TransitionDefault ACAPI::MEP::v1::Transition::PickUpDefault  |  ( |   | ) |   const
Picks up and returns the Default of the Transition.
Returns
Returns a TransitionDefault with the parameters of the object it was called for.
◆ SetAngle()
 Result< void > ACAPI::MEP::v1::Transition::SetAngle  |  ( |  double  |  angle | )
Sets the angle of the Transition.
Parameters
angle | The value to be set. Needs to be between [1, 89] degrees.
Returns
Returns an error if the parameter is not in range, otherwise nothing.
Member Data Documentation
◆ Transition
 friend ACAPI::MEP::v1::Transition::Transition